app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("name", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aaa"], ["picture", "miisuke7772000-img600x487-1383218319uc262b3484.jpg"], ["created_at", "2015-05-09 06:38:22.455888"], ["updated_at", "2015-05-09 06:38:22.455888"]]
---
  def create
    p "@@@@@@@@@@@@@@@@@@@@@@@@@@@@"
    p params
    @picture = Picture.new(picture: params[:file])
    if @picture.save!

DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 1]]
---
  def destroy
    @picture.destroy